// Атанас е алпинист, чиято следваща цел е изкачването на Еверест. Вашата задача е да напишете програма
// която да следи до каква височина е достигнал Атанас и за колко дни е изкачил върха. Той започва 
// изкачването си от ден първи от базов лагер, който е на 5 364 метра, а самият връх е на 8 848м. Преди всяко 
// изкачване на определени метри, Атанас може да си почине в някой лагер и да продължи на следващия ден 
// или да продължи изкачването без да спре, като максималното време, в което той може да изкачва върха е 
// 5 дни. Програмата приключва при получаване на командата "END", при достигане на върха(8 848м) или при 
// превишаване на разрешените 5 дни за изкачване.
// Вход
// От конзолата се четат по два реда до въвеждане на команда "END", ако са минали повече от 5 дни в 
// изкачване или се достигне върха (8 848м):
//  "Yes" / "No" - текст - дали Атанас ще нощува преди изкачването на следващите метри или не
//  Изкачени метри - цяло число в интервала [1...4000]
// Изход
// След получаване на командата "END", превишаване на разрешениете 5 дни за изкачване или се достигне върха 
// (8 848м), на конзолата се отпечатва:
//  Ако Атанас е изкачил Еверест:
// "Goal reached for {брой дни които Атанас е изкачвал върха} days!"
//  Ако Атанас НЕ е изкачил Еверест:
// "Failed!"
// "{достигнатите от Атанас метри}"

function everest(input) {
    let days = 1;
    let meeters = 5364;

    let index = 0;
    let command = input[index];

    while (command !== `END`) {
        command = input[index];

        if (command === `Yes`) {
            days++;

            if (days > 5) {
                break;
            }
        }

        index++;

        let dailyMeeters = Number(input[index]);
        meeters += dailyMeeters;

        index++;
        command = input[index];

        if (meeters >= 8848) {
            break;
        }
    }

    if (meeters >= 8848) {
        console.log(`Goal reached for ${days} days!`);
    } else {
        console.log(`Failed!`);
        console.log(`${meeters}`);
    }
}
everest(["Yes",
"1254",
"Yes",
"1402",
"No",
"250",
"Yes",
"635"])
