// Напишете програма, която прочита скрито съобщение в поредица от символи. Те се получават по един на ред до получаване на командата "End". 
// Думите се образуват от буквите в реда на четенето им. Символите, които не са латински букви трябва да бъдат игнорирани. 
// Думите скрити в потока са разделени от тайна команда от три букви – "c", "o" и "n". При първото получаване на една от тези букви, 
// тя се маркира като срещната, но не се запазва в думата. При всяко следващо нейно срещане се записва нормално в думата. 
// След като са налични и трите символа от командата, се печата думата и интервал " ". Започва се нова дума, която по същия начин чака тайната команда, за да бъде отпечатана.
// Вход
// От конзолата се чете поредица от редове с един символ на всеки до получаване на командата "End".
// Изход
// На конзолата се печата на един ред всяка дума след тайната команда, следвана от интервал.

function solve(input) {
    let command = input[0];
    let index = 0

    let letterC = 0;
    let letterO = 0;
    let letterN = 0;

    let sentence = "";
    let word = "";

    while (command !== "End") {
            let curletter = input[index];
            index++;

            if (curletter == "c"){
                letterC += 1;
                if(letterC > 1){
                    word += "c";
                }
            } else if (curletter == "o"){
                letterO += 1;
                if(letterO > 1){
                    word += "o";
                }
            } else if (curletter == "n"){
                letterN += 1;
                if(letterN > 1){
                    word += "n"
                }
            } else {
                word += `${curletter}`
            }

            if (letterN >= 1 && letterC >= 1 && letterO >= 1){
                sentence += `${word} `;
            } 
        }
        console.log(sentence);
}
solve(["H", "n", "l", "o", "c", "l", "m", "o","s", "End"])//, "c", "h", "o", "e", "r", "e", "n", "e", "End"])