// Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в определен интервал. 
// За да бъде валиден един PIN код той трябва да отговаря на следните условия:
// •	Първата и третата цифра трябва да бъдат четни.
// •	Втората цифра трябва да бъде просто число в диапазона [2...7].
// Вход
// От конзолата се четат 3 реда:
// •	Горната граница на първото число - цяло число в диапазона [1...9]
// •	Горната граница на второто число - цяло число в диапазона [1...9]
// •	Горната граница на третото число - цяло число в диапазона [1...9]
// Изход
// Да се отпечатат на конзолата всички валидни трицифрени PIN кодове, чиито цифри отговарят на съответните интервали.

function solve(input) {
    let maxNum1 = Number(input[0]);
    let maxNum2 = Number(input[1]);
    let maxNum3 = Number(input[2]);


    for (let curNum1 = 2; curNum1 <= maxNum1; curNum1 += 2) {
        for (let curNum2 = 2; curNum2 <= maxNum2; curNum2++) {
            if (curNum2 === 2 || curNum2 === 3 || curNum2 === 5 || curNum2 === 7) {
                for (let curNum3 = 2; curNum3 <= maxNum3; curNum3 += 2) {

                    console.log(`${curNum1} ${curNum2} ${curNum3}`);
                }
            }
        }
    }
}
solve(["3", "5", "5"]);