// Напишете програма, която да принтира на конзолата всички комбинации от 3 букви в зададен интервал, 
// като се пропускат комбинациите съдържащи зададена от конзолата буква. Накрая трябва да се изпринтира броят на отпечатаните комбинации.
// Вход
// Входът се чете от конзолата и съдържа точно 3 реда:
// Ред 1.	Малка буква от английската азбука за начало на интервала – от ‘a’ до ‚z’.
// Ред 2.	Малка буква от английската азбука за край на интервала  – от първата буква до ‚z’.
// Ред 3.	Малка буква от английската азбука – от ‘a’ до ‚z’ – като комбинациите съдържащи тази буквата се пропускат.
// Изход
// Да се отпечатат на един ред всички комбинации отговарящи на условието плюс броят им разделени с интервал.

function solve(input) {
    let letter1 = input[0];
    let letter2 = input[1];
    let letter3 = input[2];

    let row = ``
    let combintion = 0;

    for (let i = input.charCodeAt() ; i <= letter1; i++) {
        for (let j = input.charCodeAt() ; j <= letter2; j++) {
            for (let g = "a".charCodeAt( ) ; g <= letter3; g++) {
                if (g !== letter3) {

                    combintion += 1
                    row += `${i}${j}${g} `
                    console.log(row);

                }
            }
        }
    }
}
solve (["a" , "c" , "b"])