// Да се напише програма, която прочита едно цяло число N и генерира всички възможни "щастливи" 
// и различни 4-цифрени числа(всяка цифра от числото е в интервала [1...9]). 
// Числото трябва да отговаря на следните условия: 
// Щастливо число е 4-цифрено число, на което сбора от първите две цифри е равен на сбора от последните две. 
// Числото N трябва да се дели без остатък от сбора на първите две цифри на "щастливото" число.
// Вход
// Входът се чете от конзолата и се състои от едно цяло число в интервала [2...10000]
// Изход
// На конзолата трябва да се отпечатат всички "щастливи" и различни 4-цифрени числа, разделени с интервал

function solve(input) {
    let numberInput = Number(input[0]);

    let num1 = 0
    let num2 = 0

    let happyNum = "";

    for (let i = 1; i <= 9; i++) {
        for (let j = 1; j <= 9; j++) {
            for (let g = 1; g <= 9; g++) {
                for (let k = 1; k <= 9; k++) {

                    num1 = i + j;
                    num2 = g + k;

                    if (num1 == num2) {
                        if (numberInput / num1 === 1 || numberInput % num1 === 0) {
                            happyNum += `${i}${j}${g}${k} `
                        }
                    }
                }
            }
        }
    }
    console.log(happyNum);
}
solve(["3"])