// Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР реши да наеме точно вас за създаването на новата им система за генериране на
//  специални автомобилни номера. Всеки един специален автомобилен номер се състой от четири числа. Условията, които разграничават специалните от обикновените номера са следните: 
// •	Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна,  завършва на четна
// •	Първата цифра от номера е по-голяма от последната
// •	Сумата от втората и третата цифра трябва да е четно число
// Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
// Вход
// 1.	Първи ред - едноцифрено число - началото на интервала – цяло число в интервала [1…9]
// 2.	Втори ред - едноцифрено число - края на интервала – цяло число в интервала [1…9]
// Изход
// На конзолата трябва да се отпечатат всички специални номера, разделени с интервал.

function solve(input) {
    let startNum = Number(input[0]);
    let endNum = Number(input[1]);

    let Kombinationen = "";

    for (let i = startNum; i <= endNum; i++) {
        for (let j = startNum; j <= endNum; j++) {
            for (let g = startNum; g <= endNum; g++) {
                for (let k = startNum; k <= endNum; k++) {

                    if (i % 2 === 0 && k % 2 !== 0 && (j + g) % 2 === 0 && i > k) {
                        Kombinationen += `${i}${j}${g}${k} `
                    } else if (k % 2 === 0 && i % 2 !== 0 && (j + g) % 2 === 0 && i > k) {
                        Kombinationen += `${i}${j}${g}${k} `
                    }
                }
            }
        }
    }
    console.log(Kombinationen);
}
solve(["2", "3"])
