// Екипът на СофтУни си организира футболен турнир. Първоначално прочитаме от конзолата капацитета на стадиона и броят на всички фенове. 
// След това за всеки фен се чете секторът, в който се намира. Феновете на първия отбор са в сектор А и Б, а на втория – В и Г. Да се напише програма, 
// която изчислява процентите на феновете във всеки сектор, спрямо общия брой фенове на стадиона, както и общият процент на феновете за двата отбора, 
// спрямо капацитета на стадиона. Общият брой на феновете НЕ надвишава капацитета на стадиона.
// Вход
// От конзолата се четат поредица от числа, всяко на отделен ред:
// 1.	Капацитетът на стадиона – цяло число в интервала [1 … 10000];
// 2.	Броят на всички фенове – цяло число в интервала [1 … 10000].
// За всеки един фен, на отделен ред се прочита:
// 1.	Секторът, на който се намира – текст – "A", "B", "V" и "G".
// Изход
// Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00% и 100.00%, форматирани до втората цифра след десетичната запетая:
// 1.	Процентът на феновете в сектор А
// 2.	Процентът на феновете в сектор Б
// 3.	Процентът на феновете в сектор В
// 4.	Процентът на феновете в сектор Г
// 5.	Процентът на всички фенове, спрямо капацитета на стадиона.
function fotball(input) {
    let capacity = Number(input[0]);
    let fanCount = Number(input[1]);
    let index = 2;

    let fanSektorA = 0;
    let fanSektorB = 0;
    let fanSektorV = 0;
    let fanSektorG = 0;
    let totalFan = 0;

    for (let curFan = 1; curFan <= fanCount; curFan++) {
        let fanSektor = input[index];
        index++;
        if (fanSektor == "A") {
            fanSektorA += 1;
            totalFan += 1;
        } else if (fanSektor == "B") {
            fanSektorB += 1;
            totalFan += 1;
        } else if (fanSektor == "V") {
            fanSektorV += 1;
            totalFan += 1;
        } else if (fanSektor == "G") {
            fanSektorG += 1;
            totalFan += 1;
        }
    }
    console.log(`${((fanSektorA / fanCount) * 100).toFixed(2)}%`);
    console.log(`${((fanSektorB / fanCount) * 100).toFixed(2)}%`);
    console.log(`${((fanSektorV / fanCount) * 100).toFixed(2)}%`);
    console.log(`${((fanSektorG / fanCount) * 100).toFixed(2)}%`);
    console.log(`${((totalFan / capacity) * 100).toFixed(2)}%`);
}
fotball(["76", "10", "A", "V", "V", "V", "G", "B", "A", "V", "B", "B"]);